app/views/posts/show.html.erb

<h3>Reviews:</h3>
<% @post.reviews.each do |review| %>
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."post_id" = ?  [["post_id", 3]]