app/controllers/posts_controller.rb

    def show
      id = params[:id] # retrieve movie ID from URI route
      @post = Post.find(id) # look up movie by unique ID
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]

    def index
      @all_posts = Post.all()
---
SELECT "posts".* FROM "posts" WHERE (title LIKE '%out%') AND (zipcode LIKE '%10463%')

    def create
      if params[:post][:title] && params[:post][:description] && params[:post][:zipcode] && params[:post][:title]!="" && params[:post][:description]!="" && params[:post][:zipcode]!=""
        @post_title = params[:post][:title]
        @post_description = params[:post][:description]
        @zipcode = params[:post][:zipcode]
        # TODO: Dummy User & Post at the moment. Replace this section in Iter2\
        @user_id = current_user.id
        @user_name = current_user.user_name
        @aa = params[:post]
        @post = Post.create!(
          zipcode: @zipcode,
          title: @post_title,
          creator_id: @user_id,
          description: @post_description,
          date: "2022-01-03")
---
INSERT INTO "posts" ("post_id", "zipcode", "title", "creator_id", "description", "date") VALUES (?, ?, ?, ?, ?, ?)  [["post_id", "100"], ["zipcode", "ss"], ["title", "aa"], ["creator_id", "123"], ["description", "dd"], ["date", "2022-01-03"]]

    def edit
      @post = Post.find params[:id]
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]

    def update
      @post = Post.find params[:id]
      @post.update_attributes!(post_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "posts" SET "title" = ?, "description" = ? WHERE "posts"."id" = ?  [["title", "Check out There!"], ["description", "Updated Description for Check out There!"], ["id", 1]]

    def new_review
      @post = Post.find params[:id]
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 3]]

    def create_review
      if params[:review][:content].empty?
        flash[:notice] = "Content can't be empty"
        redirect_to(:back)
      else
        @post = Post.find params[:id]
        @post.reviews.build(:content => params[:review][:content])
        @post.save
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 3]]
INSERT INTO "reviews" ("content", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "A test review for movie 3"], ["post_id", 3], ["created_at", "2022-11-14 05:47:53.626326"], ["updated_at", "2022-11-14 05:47:53.626326"]]

    def destroy
      @post = Post.find(params[:id])
      if @post.creator_id != session[:user_id].to_s
        flash["notice"] = "Only creator can delete the post"
        redirect_to(@post)
      else
        @post.destroy
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 3]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 3]]