app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."user_id" = ? LIMIT 1  [["user_id", "chenli"]]
---
  def create
    user = User.find_by(user_id: params[:user_id])