app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."creator_id" = ?  [["creator_id", "1"]]
---
    def show
      id = params[:id] # retrieve movie ID from URI route
      @user = User.find(id)
      @all_posts = Post.where(creator_id: id)

SELECT  1 AS one FROM "users" WHERE "users"."user_name" = ? LIMIT 1  [["user_name", "lion"]]
INSERT INTO "users" ("user_name", "first_name", "last_name", "password") VALUES (?, ?, ?, ?)  [["user_name", "CChenLi"], ["first_name", "Chen"], ["last_name", "Li"], ["password", "123"]]
---
    def create
      if params["user"]["user_name"].empty?
        flash["notice"] = "User Name can't be empty"
        redirect_to '/users/new'
      elsif params["user"]["password"].empty?
        flash["notice"] = "Password can't be empty"
        redirect_to '/users/new'
      elsif User.exists?(user_name: params["user"]["user_name"])
        flash["notice"] = "Username already exist"
        redirect_to '/users/new'
      else
        @user = User.create(params.require(:user).permit(:user_name, :first_name, :last_name, :password))